---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOptionWarn
source: html/8f3c8e06-caff-362c-06c4-f8647c706eb6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOptionWarn Property

A pad in a Design Option cannot be hosted by a topography in another Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingPadByElementsInAnotherDesignOptionWarn { get; }
```